blazemeter/testing_auth.yml
---
execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 5m
  scenario: simple

scenarios:
  simple:
    script: existing-BlazeDemo.jmx
    properties:  
      log_level.jmeter: DEBUG # add JMeter property
    variables:
      home_label_name: BlazeDemo.com
    modifications:
      disable:
      - Constant Timer

reporting:
- module: passfail
  criteria:
#  - avg-rt>200ms, stop as failed
   - succ<100%
- module: blazemeter

modules:
  blazemeter:
    address: https://a.blazemeter.com
    data-address: https://data.blazemeter.com
    browser-open: none
    send-interval: 30s
    report-times-multiplier: 1000
    timeout: 5s
    artifact-upload-size-limit: 5
    public-report: false
    request-logging-limit: 1024
    report-name: CircleCI Build Jmeter 1
    test: testing OAUTH E2E Perf Test by Jmeter (CircleCI)
    project: Blazemeter demo Jmeter