blazemeter/testing_auth.yml
---
execution:
- concurrency: 100
  iterations: 20
  ramp-up: 30m
  steps: 5
  hold-for: 2h
  scenario: quick-test


scenarios:
  quick-test:
    requests:
    - http://blazedemo.com/
  blazedemo:
    default-address: blazedemo.com
    headers:
      X-Tracking: false
      Accept: "*/*"
    requests:
    - url: /
      headers:
        Accept: text/html
      assert:
      - contains:
        - ".+sometext.+"
        subject: body
        regexp: true
        not: true
    - url: /reserve.php
      method: POST
      body: 'Some Body Data'
      think-time: 2s
      assert:
      - contains:
        - 200
        subject: http-code
        not: false

        
reporting:
#- module: passfail
#  criteria:
#  - avg-rt>200ms, stop as failed
#  - failures>0%, stop as failed
- module: blazemeter

modules:
  blazemeter:
    address: https://a.blazemeter.com
    data-address: https://data.blazemeter.com
    browser-open: start
    send-interval: 30s
    report-times-multiplier: 1000
    timeout: 5s
    artifact-upload-size-limit: 5
    public-report: false
    request-logging-limit: 1024
    report-name: CircleCI Build 1
    test: testing OAUTH E2E Perf Test (CircleCI)
    project: CommonIdentityService